constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    tankBottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4624;
        startFace       860744;
    }
    tankSide
    {
        type            wall;
        inGroups        1(wall);
        nFaces          17136;
        startFace       865368;
    }
    atmosphere
    {
        type            patch;
        nFaces          4624;
        startFace       882504;
    }
)

// ************************************************************************* //
