system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.com
    \\  /    A nd           | Version:  2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1.35 -1.35 -0.10)
    ( 1.35 -1.35 -0.10)
    ( 1.35  1.35 -0.10)
    (-1.35  1.35 -0.10)
    (-1.35 -1.35  2.40)
    ( 1.35 -1.35  2.40)
    ( 1.35  1.35  2.40)
    (-1.35  1.35  2.40)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (68 68 63) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    tankBottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    tankSide
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (0 3 7 4)
            (0 4 5 1)
            (3 2 6 7)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //