system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.com
    \\  /    A nd           | Version:  2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

patches
(
    {
        name            ami1;
        patchInfo
        {
            type            cyclicAMI;
            neighbourPatch  ami2;
            transform       noOrdering;
        }
        constructFrom   patches;
        patches         (ami);
    }
    {
        name            ami2;
        patchInfo
        {
            type            cyclicAMI;
            neighbourPatch  ami1;
            transform       noOrdering;
        }
        constructFrom   patches;
        patches         (ami);
    }
);

// ************************************************************************* //